In [3]:
import pandas as pd
d={
    "Name":["Alice","Bob","Charlie"],
    "Age":[21,23,25]
    }
x=pd.DataFrame(d)
print(x)

      Name  Age
0    Alice   21
1      Bob   23
2  Charlie   25

In [4]:
df = pd.read_csv("C:/Users/Rahul/Desktop/day5/messy_employee_dataset_1000_rows.csv")

In [5]:
df.sample(10)

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
433,NaN,unknown,120000.75,it,2022-01-15,mumbai,1,NaN,True
985,NaN,60,NaN,HR,15/02/2021,Delhi,poor,five,yes
411,NaN,200,NaN,it,15/02/2021,mumbai,2,1,yes
534,NaN,unknown,NaN,Finance,NaN,Hyderabad,NaN,1,NaN
264,NaN,45,25000,NaN,15/02/2021,mumbai,3,3,False
146,user_146,200,120000.75,Finance,2020/12/01,Delhi,5,-1,yes
625,U1625,unknown,NaN,it,2020/12/01,Mumbai,NaN,five,NaN
77,U1077,NaN,NaN,HR,NaN,Bangalore,1,3,no
198,user_198,45,120000.75,NaN,invalid,DELHI,1,NaN,yes
11,user_11,18,120000.75,Finance,invalid,Mumbai,NaN,NaN,NaN

In [13]:
missing_percent = df.isna().mean() * 100

In [15]:
missing_percent.sort_values(ascending=False)

user_id              51.0
salary               31.1
join_date            21.9
is_active            20.0
city                 14.9
department           14.1
experience_years     12.7
age                  11.4
performance_score    10.1
dtype: float64

In [16]:
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

In [19]:
df["user_id"] = df["user_id"].replace("", np.nan).str.upper()

NameError: name 'np' is not defined